src/InformationRegisters/ЭлектронныеПодписиКЭДО/ЭлектронныеПодписиКЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭлектронныеПодписиКЭДО</name>
  <dimensions>
    <name>ПодписанныйОбъект</name>
    <type>
      <types>DefinedType.ПодписанныйОбъект</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьОтпечаток</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>28</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьДатаПодписи</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьМЧД</name>
    <type>
      <types>CatalogRef.УдалитьМашиночитаемыеДоверенностиКЭДО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РольПодписанта</name>
    <type>
      <types>EnumRef.РолиПодписантовКЭДО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторПодписи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЭлектронныеПодписи/ЭлектронныеПодписи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭлектронныеПодписи</name>
  <resources>
    <name>ТребуетсяПроверка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипПодписи</name>
    <type>
      <types>EnumRef.ТипыПодписиКриптографии</types>
    </type>
  </resources>
  <resources>
    <name>СрокДействияПоследнейМеткиВремени</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПроверкиПодписи</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ИмяФайлаПодписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>260</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>КомуВыданСертификат</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Отпечаток</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>28</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подпись</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ПодписьВерна</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сертификат</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПодписи</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>УстановившийПодпись</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <attributes>
    <name>ОшибкаПриАвтоматическомПродлении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПропуститьПриПродлении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПодписи</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьМатематическиВерна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаМатематическойПроверкиПодписи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаПроверкиДополнительныхАтрибутов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеАтрибутыПровереныВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторРучнойПроверкиДополнительныхАтрибутов</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбоснованиеРучнойПроверкиДополнительныхАтрибутов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПодписанныйОбъект</name>
    <type>
      <types>DefinedType.ПодписанныйОбъект</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЭлектронныеПодписиКЭДО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьИдентификаторыПодписей(ПараметрыОбновления = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустойИдентификатор", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Если ПараметрыОбновления = Неопределено Тогда
		МассивОбновленных = Новый Массив;
	Иначе
		
		Если ПараметрыОбновления.Свойство("МассивОбновленных") Тогда
			МассивОбновленных = ПараметрыОбновления.МассивОбновленных;
		Иначе
			МассивОбновленных = Новый Массив;
			ПараметрыОбновления.Вставить("МассивОбновленных", МассивОбновленных);
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивОбновленных", МассивОбновленных);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
		|	ЭлектронныеПодписиКЭДО.ПодписанныйОбъект КАК ПодписанныйОбъект
		|ПОМЕСТИТЬ ВТОбновляемыеОбъекты
		|ИЗ
		|	РегистрСведений.ЭлектронныеПодписиКЭДО КАК ЭлектронныеПодписиКЭДО
		|ГДЕ
		|	НЕ ЭлектронныеПодписиКЭДО.ПодписанныйОбъект В (&МассивОбновленных)
		|	И ЭлектронныеПодписиКЭДО.ИдентификаторПодписи = &ПустойИдентификатор";
	
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000","");
	КонецЕсли;
	
	Запрос.Выполнить().Выбрать();
	Если ЗарплатаКадры.ВТСодержитСтроки(Запрос.МенеджерВременныхТаблиц, "ВТОбновляемыеОбъекты") = 0 Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОбновляемыеОбъекты.ПодписанныйОбъект КАК ПодписанныйОбъект,
		|	ЭлектронныеПодписиКЭДО.УдалитьОтпечаток КАК УдалитьОтпечаток,
		|	ЭлектронныеПодписиКЭДО.УдалитьДатаПодписи КАК УдалитьДатаПодписи,
		|	ЭлектронныеПодписиКЭДО.РольПодписанта КАК РольПодписанта,
		|	ЭлектронныеПодписиКЭДО.УдалитьМЧД КАК УдалитьМЧД,
		|	ЭлектронныеПодписи.ИдентификаторПодписи КАК ИдентификаторПодписи
		|ПОМЕСТИТЬ ВТЗаписиСИдентификатором
		|ИЗ
		|	ВТОбновляемыеОбъекты КАК ОбновляемыеОбъекты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЭлектронныеПодписиКЭДО КАК ЭлектронныеПодписиКЭДО
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭлектронныеПодписи КАК ЭлектронныеПодписи
		|			ПО ЭлектронныеПодписиКЭДО.ПодписанныйОбъект = ЭлектронныеПодписи.ПодписанныйОбъект
		|				И ЭлектронныеПодписиКЭДО.УдалитьОтпечаток = ЭлектронныеПодписи.Отпечаток
		|				И ЭлектронныеПодписиКЭДО.УдалитьДатаПодписи = ЭлектронныеПодписи.ДатаПодписи
		|		ПО ОбновляемыеОбъекты.ПодписанныйОбъект = ЭлектронныеПодписиКЭДО.ПодписанныйОбъект
		|ГДЕ
		|	ЭлектронныеПодписиКЭДО.ИдентификаторПодписи = &ПустойИдентификатор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаписиСИдентификатором.ПодписанныйОбъект КАК ПодписанныйОбъект,
		|	ЗаписиСИдентификатором.УдалитьОтпечаток КАК УдалитьОтпечаток,
		|	ЗаписиСИдентификатором.УдалитьДатаПодписи КАК УдалитьДатаПодписи,
		|	ЗаписиСИдентификатором.РольПодписанта КАК РольПодписанта,
		|	ЗаписиСИдентификатором.УдалитьМЧД КАК УдалитьМЧД,
		|	ЗаписиСИдентификатором.ИдентификаторПодписи КАК ИдентификаторПодписи,
		|	1 КАК КоличествоИдентификаторов
		|ИЗ
		|	ВТЗаписиСИдентификатором КАК ЗаписиСИдентификатором
		|ГДЕ
		|	НЕ ЗаписиСИдентификатором.ИдентификаторПодписи ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаписиСИдентификатором.ПодписанныйОбъект,
		|	ЗаписиСИдентификатором.УдалитьОтпечаток,
		|	ЗаписиСИдентификатором.УдалитьДатаПодписи,
		|	ЗаписиСИдентификатором.РольПодписанта,
		|	ЗаписиСИдентификатором.УдалитьМЧД,
		|	МАКСИМУМ(ЭлектронныеПодписи.ИдентификаторПодписи),
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЭлектронныеПодписи.ИдентификаторПодписи)
		|ИЗ
		|	ВТЗаписиСИдентификатором КАК ЗаписиСИдентификатором
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭлектронныеПодписи КАК ЭлектронныеПодписи
		|		ПО ЗаписиСИдентификатором.ПодписанныйОбъект = ЭлектронныеПодписи.ПодписанныйОбъект
		|			И ЗаписиСИдентификатором.УдалитьОтпечаток = ЭлектронныеПодписи.Отпечаток
		|ГДЕ
		|	ЗаписиСИдентификатором.ИдентификаторПодписи ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаписиСИдентификатором.ПодписанныйОбъект,
		|	ЗаписиСИдентификатором.УдалитьОтпечаток,
		|	ЗаписиСИдентификатором.УдалитьДатаПодписи,
		|	ЗаписиСИдентификатором.РольПодписанта,
		|	ЗаписиСИдентификатором.УдалитьМЧД
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПодписанныйОбъект";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("ПодписанныйОбъект") Цикл
		
		МассивОбновленных.Добавить(Выборка.ПодписанныйОбъект);
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "РегистрСведений.ЭлектронныеПодписиКЭДО", "ПодписанныйОбъект", Выборка.ПодписанныйОбъект) Тогда
			Продолжить;
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.КоличествоИдентификаторов = 1 Тогда
				НаборЗаписей = РегистрыСведений.ЭлектронныеПодписиКЭДО.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ПодписанныйОбъект.Установить(Выборка.ПодписанныйОбъект);
				НаборЗаписей.Отбор.УдалитьОтпечаток.Установить(Выборка.УдалитьОтпечаток);
				НаборЗаписей.Отбор.УдалитьДатаПодписи.Установить(Выборка.УдалитьДатаПодписи);
				НаборЗаписей.Отбор.РольПодписанта.Установить(Выборка.РольПодписанта);
				НаборЗаписей.Отбор.УдалитьМЧД.Установить(Выборка.УдалитьМЧД);
				
				НаборЗаписей.Прочитать();
				Для Каждого Запись Из НаборЗаписей Цикл
					Запись.ИдентификаторПодписи = Выборка.ИдентификаторПодписи;
				КонецЦикла;
				
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			КонецЕсли;
		КонецЦикла; 
		
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
